Public Member Functions | Friends | List of all members
CRhinoDib::CFastPixelAccess Class Reference
#include <RhinoSdkUiDibMac.h>
 Public Member Functions
CFastPixelAccess (const CFastPixelAccess &)=delete
Copying. More...
CFastPixelAccess (CRhinoDib &dib)
~CFastPixelAccess ()
CRhinoDib &  | Dib (void)
BOOL  | GetPixel (long x, long y, int &r, int &g, int &b, int &alpha) const
int  | Height (void) const
bool  | IsValid (void) const
const CFastPixelAccess &  | operator= (const CFastPixelAccess &)=delete
BOOL  | SetPixel (long x, long y, int r, int g, int b, int alpha=255)
int  | Width (void) const
 Friends
class  | Impl
Constructor & Destructor Documentation
◆ CFastPixelAccess() [1/2]
 CRhinoDib::CFastPixelAccess::CFastPixelAccess  |  ( |  CRhinoDib &  |  dib | )
◆ ~CFastPixelAccess()
 CRhinoDib::CFastPixelAccess::~CFastPixelAccess  |  ( |   | )
◆ CFastPixelAccess() [2/2]
 CRhinoDib::CFastPixelAccess::CFastPixelAccess  |  ( |  const CFastPixelAccess &  |   | )
delete
Copying.
Member Function Documentation
◆ Dib()
 CRhinoDib& CRhinoDib::CFastPixelAccess::Dib  |  ( |  void  |   | )
◆ GetPixel()
 BOOL CRhinoDib::CFastPixelAccess::GetPixel  |  ( |  long  |  x,
|  long  |  y,
|  int &  |  r,
|  int &  |  g,
|  int &  |  b,
|  int &  |  alpha
) |   |  const
Note that these functions will call CRhinoDib::GetPixel or SetPixel if IsValid returns false (so they will also be slow) but in most cases, these functions will be way, way faster than the raw functions on CRhinoDib, as long as the object is retained during the pixel loop
◆ Height()
 int CRhinoDib::CFastPixelAccess::Height  |  ( |  void  |   | ) |   const
◆ IsValid()
 bool CRhinoDib::CFastPixelAccess::IsValid  |  ( |  void  |   | ) |   const
◆ operator=()
 const CFastPixelAccess& CRhinoDib::CFastPixelAccess::operator=  |  ( |  const CFastPixelAccess &  |   | )
delete
◆ SetPixel()
 BOOL CRhinoDib::CFastPixelAccess::SetPixel  |  ( |  long  |  x,
|  long  |  y,
|  int  |  r,
|  int  |  g,
|  int  |  b,
|  int  |  alpha = 255
)
◆ Width()
 int CRhinoDib::CFastPixelAccess::Width  |  ( |  void  |   | ) |   const
Friends And Related Function Documentation
◆ Impl
 friend class Impl
friend