Public Member Functions | List of all members
ON_SleepLockGuard Class Reference
OpenNURBS
#include <opennurbs_sleeplock.h>
 Public Member Functions
ON_SleepLockGuard (class ON_SleepLock &sleep_lock)
ON_SleepLockGuard (class ON_SleepLock &sleep_lock, unsigned int interval_wait_msecs, unsigned int max_wait_msecs)
ON_SleepLockGuard (class ON_SleepLock &sleep_lock, unsigned int interval_wait_msecs, unsigned int max_wait_msecs, bool bStealLockAfterWaiting)
ON_SleepLockGuard (const class ON_Brep &)
~ON_SleepLockGuard ()
const bool  | IsManagingLock () const
void  | ReturnLock ()
Constructor & Destructor Documentation
◆ ON_SleepLockGuard() [1/4]
 ON_SleepLockGuard::ON_SleepLockGuard  |  ( |  class ON_SleepLock &  |  sleep_lock | )
Description: Calls sleep_lock.GetLock(). Parameters: sleep_lock - [in] ON_SleepLock to manage.
◆ ON_SleepLockGuard() [2/4]
 ON_SleepLockGuard::ON_SleepLockGuard  |  ( |  class ON_SleepLock &  |  sleep_lock,
|  unsigned int  |  interval_wait_msecs,
|  unsigned int  |  max_wait_msecs
)
Description: Calls sleep_lock.GetLock(interval_wait_msecs,max_wait_msecs). Parameters: sleep_lock - [in] ON_SleepLock to manage.
◆ ON_SleepLockGuard() [3/4]
 ON_SleepLockGuard::ON_SleepLockGuard  |  ( |  class ON_SleepLock &  |  sleep_lock,
|  unsigned int  |  interval_wait_msecs,
|  unsigned int  |  max_wait_msecs,
|  bool  |  bStealLockAfterWaiting
)
Description: Calls sleep_lock.GetLock(interval_wait_msecs,max_wait_msecs,bStealLockAfterWaiting). Parameters: sleep_lock - [in] ON_SleepLock to manage.
◆ ~ON_SleepLockGuard()
 ON_SleepLockGuard::~ON_SleepLockGuard  |  ( |   | )
Description: Calls sleep_lock.ReturnLock().
◆ ON_SleepLockGuard() [4/4]
 ON_SleepLockGuard::ON_SleepLockGuard  |  ( |  const class ON_Brep &  |   | )
Member Function Documentation
◆ IsManagingLock()
 const bool ON_SleepLockGuard::IsManagingLock  |  ( |   | ) |   const
Returns: True if this instance currently has the lock.
◆ ReturnLock()
 void ON_SleepLockGuard::ReturnLock  |  ( |   | )
Description: If this instance has the lock, it is returned and the destructor does nothing.