Static Public Member Functions | List of all members
ON_PhysicallyBasedMaterial::ParametersNames Class Reference
#include <opennurbs_material.h>
 Static Public Member Functions
static ON_wString  | AmbientOcclusion (void)
static ON_wString  | Anisotropic (void)
static ON_wString  | AnisotropicRotation (void)
static ON_wString  | BaseColor (void)
static ON_wString  | BRDF (void)
static ON_wString  | Bump (void)
static ON_wString  | Clearcoat (void)
static ON_wString  | ClearcoatBump (void)
static ON_wString  | ClearcoatRoughness (void)
static ON_wString  | Displacement (void)
static ON_wString  | Emission (void)
static ON_wString  | Metallic (void)
static ON_wString  | Normal (void)
static ON_wString  | Opacity (void)
static ON_wString  | OpacityIor (void)
static ON_wString  | OpacityRoughness (void)
static ON_wString  | Roughness (void)
static ON_wString  | Sheen (void)
static ON_wString  | SheenTint (void)
static ON_wString  | Smudge (void)
static ON_wString  | Specular (void)
static ON_wString  | SpecularTint (void)
static ON_wString  | Subsurface (void)
static ON_wString  | SubsurfaceScatteringColor (void)
static ON_wString  | SubsurfaceScatteringRadius (void)
Member Function Documentation
◆ AmbientOcclusion()
 static ON_wString ON_PhysicallyBasedMaterial::ParametersNames::AmbientOcclusion  |  ( |  void  |   | )
static
◆ Anisotropic()
 static ON_wString ON_PhysicallyBasedMaterial::ParametersNames::Anisotropic  |  ( |  void  |   | )
static
◆ AnisotropicRotation()
 static ON_wString ON_PhysicallyBasedMaterial::ParametersNames::AnisotropicRotation  |  ( |  void  |   | )
static
◆ BaseColor()
 static ON_wString ON_PhysicallyBasedMaterial::ParametersNames::BaseColor  |  ( |  void  |   | )
static
◆ BRDF()
 static ON_wString ON_PhysicallyBasedMaterial::ParametersNames::BRDF  |  ( |  void  |   | )
static
◆ Bump()
 static ON_wString ON_PhysicallyBasedMaterial::ParametersNames::Bump  |  ( |  void  |   | )
static
◆ Clearcoat()
 static ON_wString ON_PhysicallyBasedMaterial::ParametersNames::Clearcoat  |  ( |  void  |   | )
static
◆ ClearcoatBump()
 static ON_wString ON_PhysicallyBasedMaterial::ParametersNames::ClearcoatBump  |  ( |  void  |   | )
static
◆ ClearcoatRoughness()
 static ON_wString ON_PhysicallyBasedMaterial::ParametersNames::ClearcoatRoughness  |  ( |  void  |   | )
static
◆ Displacement()
 static ON_wString ON_PhysicallyBasedMaterial::ParametersNames::Displacement  |  ( |  void  |   | )
static
◆ Emission()
 static ON_wString ON_PhysicallyBasedMaterial::ParametersNames::Emission  |  ( |  void  |   | )
static
◆ Metallic()
 static ON_wString ON_PhysicallyBasedMaterial::ParametersNames::Metallic  |  ( |  void  |   | )
static
◆ Normal()
 static ON_wString ON_PhysicallyBasedMaterial::ParametersNames::Normal  |  ( |  void  |   | )
static
◆ Opacity()
 static ON_wString ON_PhysicallyBasedMaterial::ParametersNames::Opacity  |  ( |  void  |   | )
static
◆ OpacityIor()
 static ON_wString ON_PhysicallyBasedMaterial::ParametersNames::OpacityIor  |  ( |  void  |   | )
static
◆ OpacityRoughness()
 static ON_wString ON_PhysicallyBasedMaterial::ParametersNames::OpacityRoughness  |  ( |  void  |   | )
static
◆ Roughness()
 static ON_wString ON_PhysicallyBasedMaterial::ParametersNames::Roughness  |  ( |  void  |   | )
static
◆ Sheen()
 static ON_wString ON_PhysicallyBasedMaterial::ParametersNames::Sheen  |  ( |  void  |   | )
static
◆ SheenTint()
 static ON_wString ON_PhysicallyBasedMaterial::ParametersNames::SheenTint  |  ( |  void  |   | )
static
◆ Smudge()
 static ON_wString ON_PhysicallyBasedMaterial::ParametersNames::Smudge  |  ( |  void  |   | )
static
◆ Specular()
 static ON_wString ON_PhysicallyBasedMaterial::ParametersNames::Specular  |  ( |  void  |   | )
static
◆ SpecularTint()
 static ON_wString ON_PhysicallyBasedMaterial::ParametersNames::SpecularTint  |  ( |  void  |   | )
static
◆ Subsurface()
 static ON_wString ON_PhysicallyBasedMaterial::ParametersNames::Subsurface  |  ( |  void  |   | )
static
◆ SubsurfaceScatteringColor()
 static ON_wString ON_PhysicallyBasedMaterial::ParametersNames::SubsurfaceScatteringColor  |  ( |  void  |   | )
static
◆ SubsurfaceScatteringRadius()
 static ON_wString ON_PhysicallyBasedMaterial::ParametersNames::SubsurfaceScatteringRadius  |  ( |  void  |   | )
static