Public Types | Public Member Functions | Static Public Member Functions | Public Attributes | Static Public Attributes | List of all members
ON_SubDComponentPtr Class Reference
OpenNURBS
#include <opennurbs_subd.h>
 Public Types
enum  | Type : unsigned char { Type::Unset = 0, Type::Vertex = 2, Type::Edge = 4, Type::Face = 6 }
 Public Member Functions
ON_SubDComponentPtr  | ClearMark () const
unsigned int  | ClearStates (ON_ComponentStatus states_to_clear)
class ON_SubDComponentBase *  | ComponentBase () const
ON_COMPONENT_INDEX  | ComponentIndex () const
ON__UINT_PTR  | ComponentMark () const
ON_SubDComponentPtr::Type  | ComponentType () const
class ON_SubDEdge *  | Edge () const
ON_SubDEdgePtr  | EdgePtr () const
class ON_SubDFace *  | Face () const
ON_SubDFacePtr  | FacePtr () const
bool  | IsNotNull () const
bool  | IsNull () const
ON_SubDComponentPtr  | SetMark () const
unsigned int  | SetStates (ON_ComponentStatus states_to_set)
unsigned int  | SetStatus (ON_ComponentStatus status)
ON_ComponentStatus  | Status () const
ON_SubDComponentPtr  | ToggleMark () const
const ON_wString  | ToString () const
wchar_t *  | ToString (wchar_t *s, size_t s_capacity) const
class ON_SubDVertex *  | Vertex () const
ON_SubDVertexPtr  | VertexPtr () const
 Static Public Member Functions
static int  | Compare (const ON_SubDComponentPtr *a, const ON_SubDComponentPtr *b)
static int  | CompareComponentPtrType (ON_SubDComponentPtr::Type a, ON_SubDComponentPtr::Type b)
static int  | CompareType (const ON_SubDComponentPtr *a, const ON_SubDComponentPtr *b)
static ON_SubDComponentPtr::Type  | ComponentPtrTypeFromUnsigned (unsigned int component_pointer_type_as_unsigned)
static const ON_SubDComponentPtr  | Create (const class ON_SubDEdge *edge)
static const ON_SubDComponentPtr  | Create (const class ON_SubDEdge *edge, ON__UINT_PTR edge_mark)
static const ON_SubDComponentPtr  | Create (const class ON_SubDFace *face)
static const ON_SubDComponentPtr  | Create (const class ON_SubDFace *face, ON__UINT_PTR face_mark)
static const ON_SubDComponentPtr  | Create (const class ON_SubDVertex *vertex)
static const ON_SubDComponentPtr  | Create (const class ON_SubDVertex *vertex, ON__UINT_PTR vertex_mark)
static const ON_SubDComponentPtr  | Create (ON_SubDEdgePtr edgeptr)
static const ON_SubDComponentPtr  | Create (ON_SubDFacePtr faceptr)
static const ON_SubDComponentPtr  | Create (ON_SubDVertexPtr vertexptr)
static const ON_SubDComponentPtr  | CreateNull (ON_SubDComponentPtr::Type component_type, bool bMark)
 Public Attributes
ON__UINT_PTR  | m_ptr
 Static Public Attributes
static const ON_SubDComponentPtr  | Null
// nullptr, type = unset, mark = 0 More...
Member Enumeration Documentation
◆ Type
 enum ON_SubDComponentPtr::Type : unsigned char
strong
Enumerator
Unset
Vertex
Edge
Face
Member Function Documentation
◆ ClearMark()
 ON_SubDComponentPtr ON_SubDComponentPtr::ClearMark  |  ( |   | ) |   const
◆ ClearStates()
 unsigned int ON_SubDComponentPtr::ClearStates  |  ( |  ON_ComponentStatus  |  states_to_clear | )
Returns: 1: status changed. 0: status not changed.
◆ Compare()
 static int ON_SubDComponentPtr::Compare  |  ( |  const ON_SubDComponentPtr *  |  a,
|  const ON_SubDComponentPtr *  |  b
)
static
◆ CompareComponentPtrType()
 static int ON_SubDComponentPtr::CompareComponentPtrType  |  ( |  ON_SubDComponentPtr::Type  |  a,
|  ON_SubDComponentPtr::Type  |  b
)
static
Description: ON_SubDComponentPtr::Type::Vertex < ON_SubDComponentPtr::Type::Edge < ON_SubDComponentPtr::Type::Face < ON_SubDComponentPtr::Type::Unset < invalid
◆ CompareType()
 static int ON_SubDComponentPtr::CompareType  |  ( |  const ON_SubDComponentPtr *  |  a,
|  const ON_SubDComponentPtr *  |  b
)
static
◆ ComponentBase()
 class ON_SubDComponentBase* ON_SubDComponentPtr::ComponentBase  |  ( |   | ) |   const
◆ ComponentIndex()
 ON_COMPONENT_INDEX ON_SubDComponentPtr::ComponentIndex  |  ( |   | ) |   const
◆ ComponentMark()
 ON__UINT_PTR ON_SubDComponentPtr::ComponentMark  |  ( |   | ) |   const
Returns: 0 or 1. The interpretation of the mark varies depending on the context. For vertices, this is the vertex mark. For edges, this is generally an index into ON_SubDEdge.m_vertex[] or a direction flag with 1 indicating a reversed direction. For face, this is generally an orientation flag with 1 indicating a reversed (clockwise) orientation.
◆ ComponentPtrTypeFromUnsigned()
 static ON_SubDComponentPtr::Type ON_SubDComponentPtr::ComponentPtrTypeFromUnsigned  |  ( |  unsigned int  |  component_pointer_type_as_unsigned | )
static
◆ ComponentType()
 ON_SubDComponentPtr::Type ON_SubDComponentPtr::ComponentType  |  ( |   | ) |   const
◆ Create() [1/9]
 static const ON_SubDComponentPtr ON_SubDComponentPtr::Create  |  ( |  const class ON_SubDEdge *  |  edge | )
static
◆ Create() [2/9]
 static const ON_SubDComponentPtr ON_SubDComponentPtr::Create  |  ( |  const class ON_SubDEdge *  |  edge,
|  ON__UINT_PTR  |  edge_mark
)
static
◆ Create() [3/9]
 static const ON_SubDComponentPtr ON_SubDComponentPtr::Create  |  ( |  const class ON_SubDFace *  |  face | )
static
◆ Create() [4/9]
 static const ON_SubDComponentPtr ON_SubDComponentPtr::Create  |  ( |  const class ON_SubDFace *  |  face,
|  ON__UINT_PTR  |  face_mark
)
static
◆ Create() [5/9]
 static const ON_SubDComponentPtr ON_SubDComponentPtr::Create  |  ( |  const class ON_SubDVertex *  |  vertex | )
static
◆ Create() [6/9]
 static const ON_SubDComponentPtr ON_SubDComponentPtr::Create  |  ( |  const class ON_SubDVertex *  |  vertex,
|  ON__UINT_PTR  |  vertex_mark
)
static
◆ Create() [7/9]
 static const ON_SubDComponentPtr ON_SubDComponentPtr::Create  |  ( |  ON_SubDEdgePtr  |  edgeptr | )
static
◆ Create() [8/9]
 static const ON_SubDComponentPtr ON_SubDComponentPtr::Create  |  ( |  ON_SubDFacePtr  |  faceptr | )
static
◆ Create() [9/9]
 static const ON_SubDComponentPtr ON_SubDComponentPtr::Create  |  ( |  ON_SubDVertexPtr  |  vertexptr | )
static
◆ CreateNull()
 static const ON_SubDComponentPtr ON_SubDComponentPtr::CreateNull  |  ( |  ON_SubDComponentPtr::Type  |  component_type,
|  bool  |  bMark
)
static
◆ Edge()
 class ON_SubDEdge* ON_SubDComponentPtr::Edge  |  ( |   | ) |   const
◆ EdgePtr()
 ON_SubDEdgePtr ON_SubDComponentPtr::EdgePtr  |  ( |   | ) |   const
◆ Face()
 class ON_SubDFace* ON_SubDComponentPtr::Face  |  ( |   | ) |   const
◆ FacePtr()
 ON_SubDFacePtr ON_SubDComponentPtr::FacePtr  |  ( |   | ) |   const
◆ IsNotNull()
 bool ON_SubDComponentPtr::IsNotNull  |  ( |   | ) |   const
◆ IsNull()
 bool ON_SubDComponentPtr::IsNull  |  ( |   | ) |   const
Returns: True if the ComponentBase() pointer is nullptr. Note that type and mark may be set.
◆ SetMark()
 ON_SubDComponentPtr ON_SubDComponentPtr::SetMark  |  ( |   | ) |   const
◆ SetStates()
 unsigned int ON_SubDComponentPtr::SetStates  |  ( |  ON_ComponentStatus  |  states_to_set | )
Returns: 1: status changed. 0: status not changed.
◆ SetStatus()
 unsigned int ON_SubDComponentPtr::SetStatus  |  ( |  ON_ComponentStatus  |  status | )
Description: Makes "this" an exact copy of status. Parameters: status - [in] Returns: 1: status changed. 0: status not changed.
◆ Status()
 ON_ComponentStatus ON_SubDComponentPtr::Status  |  ( |   | ) |   const
◆ ToggleMark()
 ON_SubDComponentPtr ON_SubDComponentPtr::ToggleMark  |  ( |   | ) |   const
◆ ToString() [1/2]
 const ON_wString ON_SubDComponentPtr::ToString  |  ( |   | ) |   const
◆ ToString() [2/2]
 wchar_t* ON_SubDComponentPtr::ToString  |  ( |  wchar_t *  |  s,
|  size_t  |  s_capacity
) |   |  const
◆ Vertex()
 class ON_SubDVertex* ON_SubDComponentPtr::Vertex  |  ( |   | ) |   const
◆ VertexPtr()
 ON_SubDVertexPtr ON_SubDComponentPtr::VertexPtr  |  ( |   | ) |   const
Member Data Documentation
◆ m_ptr
 ON__UINT_PTR ON_SubDComponentPtr::m_ptr
For performance reasons, m_ptr is not initialized and no constructors are declared or implemented. If you require initialization, then use x = ON_SubDComponentPtr::Null or x = ON_SubDComponentPtr::Create(...).
◆ Null
 const ON_SubDComponentPtr ON_SubDComponentPtr::Null
static
// nullptr, type = unset, mark = 0