Public Member Functions | Public Attributes | List of all members
CRhinoDib::Pixel Class Reference
friend void Combine(const CRhinoDib&, CRhinoDib&, const float*, float*); More...
#include <RhinoSdkUiDibMac.h>
 Public Member Functions
Pixel (BITMAPINFO &in_bmi, const CRhinoDib *in_dib, int in_cd, long in_x, long in_y, unsigned char in_r, unsigned char in_g, unsigned char in_b, int in_alpha, unsigned char *in_pRGBAPixel8=nullptr)
float  | Float (void) const
To support DIBs where a 32-bit float type is stored in the 32 bits of each pixel. Does not work on non-32-bit images. More...
void  | Set (float)
void  | Set (unsigned char in_r, unsigned char in_g, unsigned char in_b, int in_alpha)
 Public Attributes
int  | alpha
unsigned char  | b
BITMAPINFO &  | bmi
int  | color_depth
unsigned char  | g
const CRhinoDib *  | pDib
unsigned char *  | pRGBAPixel8
unsigned char  | r
ON__UINT_PTR  | reserved
long  | x
long  | y
Detailed Description
friend void Combine(const CRhinoDib&, CRhinoDib&, const float*, float*);
Constructor & Destructor Documentation
◆ Pixel()
 CRhinoDib::Pixel::Pixel  |  ( |  BITMAPINFO &  |  in_bmi,
|  const CRhinoDib *  |  in_dib,
|  int  |  in_cd,
|  long  |  in_x,
|  long  |  in_y,
|  unsigned char  |  in_r,
|  unsigned char  |  in_g,
|  unsigned char  |  in_b,
|  int  |  in_alpha,
|  unsigned char *  |  in_pRGBAPixel8 = nullptr
)
inline
Member Function Documentation
◆ Float()
 float CRhinoDib::Pixel::Float  |  ( |  void  |   | ) |   const
To support DIBs where a 32-bit float type is stored in the 32 bits of each pixel. Does not work on non-32-bit images.
◆ Set() [1/2]
 void CRhinoDib::Pixel::Set  |  ( |  float  |   | )
◆ Set() [2/2]
 void CRhinoDib::Pixel::Set  |  ( |  unsigned char  |  in_r,
|  unsigned char  |  in_g,
|  unsigned char  |  in_b,
|  int  |  in_alpha
)
Member Data Documentation
◆ alpha
 int CRhinoDib::Pixel::alpha
◆ b
 unsigned char CRhinoDib::Pixel::b
◆ bmi
 BITMAPINFO& CRhinoDib::Pixel::bmi
◆ color_depth
 int CRhinoDib::Pixel::color_depth
◆ g
 unsigned char CRhinoDib::Pixel::g
◆ pDib
 const CRhinoDib* CRhinoDib::Pixel::pDib
◆ pRGBAPixel8
 unsigned char* CRhinoDib::Pixel::pRGBAPixel8
Only set this value when the exact format is known (8-bit RGBA or RGB) Note that this is Mac only.
◆ r
 unsigned char CRhinoDib::Pixel::r
◆ reserved
 ON__UINT_PTR CRhinoDib::Pixel::reserved
◆ x
 long CRhinoDib::Pixel::x
◆ y
 long CRhinoDib::Pixel::y