Public Types | Public Member Functions | Static Public Member Functions | Static Public Attributes | List of all members
ON_FontFaceQuartet Class Reference
OpenNURBS
#include <opennurbs_font.h>
 Public Types
enum  | Member : unsigned char {
 Member::Unset = 0, Member::Regular = 1, Member::Bold = 2, Member::Italic = 3,
 Member::BoldItalic = 4
 }
 Public Member Functions
ON_FontFaceQuartet ()=default
ON_FontFaceQuartet (const ON_FontFaceQuartet &)=default
ON_FontFaceQuartet (const wchar_t *quartet_name, const class ON_Font *regular, const class ON_Font *bold, const class ON_Font *italic, const class ON_Font *bold_italic)
~ON_FontFaceQuartet ()=default
const class ON_Font *  | BoldFace () const
const class ON_Font *  | BoldItalicFace () const
const ON_Font *  | ClosestFace (bool bPreferedBold, bool bPreferedItalic) const
const ON_Font *  | ClosestFace (ON_FontFaceQuartet::Member member) const
void  | Dump (ON_TextLog &text_log) const
const ON_Font *  | Face (bool bBold, bool bItalic) const
const ON_Font *  | Face (ON_FontFaceQuartet::Member member) const
unsigned int  | FaceCount () const
bool  | HasAllFaces () const
bool  | HasBoldFace () const
bool  | HasBoldItalicFace () const
bool  | HasItalicFace () const
bool  | HasRegularFace () const
bool  | IsEmpty () const
const class ON_Font *  | ItalicFace () const
ON_FontFaceQuartet &  | operator= (const ON_FontFaceQuartet &)=default
ON_FontFaceQuartet::Member  | QuartetMember (const ON_Font *font) const
const ON_wString  | QuartetName () const
const class ON_Font *  | RegularFace () const
const ON_wString  | RichTextSample (ON::RichTextStyle rich_text_style) const
 Static Public Member Functions
static int  | CompareQuartetName (const ON_FontFaceQuartet *lhs, const ON_FontFaceQuartet *rhs)
 Static Public Attributes
static const ON_FontFaceQuartet  | Empty
Member Enumeration Documentation
◆ Member
 enum ON_FontFaceQuartet::Member : unsigned char
strong
Enumerator
Unset
Regular
Bold
Italic
BoldItalic
Constructor & Destructor Documentation
◆ ON_FontFaceQuartet() [1/3]
 ON_FontFaceQuartet::ON_FontFaceQuartet  |  ( |   | )
default
◆ ~ON_FontFaceQuartet()
 ON_FontFaceQuartet::~ON_FontFaceQuartet  |  ( |   | )
default
◆ ON_FontFaceQuartet() [2/3]
 ON_FontFaceQuartet::ON_FontFaceQuartet  |  ( |  const ON_FontFaceQuartet &  |   | )
default
◆ ON_FontFaceQuartet() [3/3]
 ON_FontFaceQuartet::ON_FontFaceQuartet  |  ( |  const wchar_t *  |  quartet_name,
|  const class ON_Font *  |  regular,
|  const class ON_Font *  |  bold,
|  const class ON_Font *  |  italic,
|  const class ON_Font *  |  bold_italic
)
Member Function Documentation
◆ BoldFace()
 const class ON_Font* ON_FontFaceQuartet::BoldFace  |  ( |   | ) |   const
◆ BoldItalicFace()
 const class ON_Font* ON_FontFaceQuartet::BoldItalicFace  |  ( |   | ) |   const
◆ ClosestFace() [1/2]
 const ON_Font* ON_FontFaceQuartet::ClosestFace  |  ( |  bool  |  bPreferedBold,
|  bool  |  bPreferedItalic
) |   |  const
◆ ClosestFace() [2/2]
 const ON_Font* ON_FontFaceQuartet::ClosestFace  |  ( |  ON_FontFaceQuartet::Member  |  member | ) |   const
Parameters: member - [in] Returns: Closest quartet member.
◆ CompareQuartetName()
 static int ON_FontFaceQuartet::CompareQuartetName  |  ( |  const ON_FontFaceQuartet *  |  lhs,
|  const ON_FontFaceQuartet *  |  rhs
)
static
◆ Dump()
 void ON_FontFaceQuartet::Dump  |  ( |  ON_TextLog &  |  text_log | ) |   const
◆ Face() [1/2]
 const ON_Font* ON_FontFaceQuartet::Face  |  ( |  bool  |  bBold,
|  bool  |  bItalic
) |   |  const
◆ Face() [2/2]
 const ON_Font* ON_FontFaceQuartet::Face  |  ( |  ON_FontFaceQuartet::Member  |  member | ) |   const
Parameters: member - [in] Returns: Specified quartet member.
◆ FaceCount()
 unsigned int ON_FontFaceQuartet::FaceCount  |  ( |   | ) |   const
Returns: 0,1,2,3 or 4
◆ HasAllFaces()
 bool ON_FontFaceQuartet::HasAllFaces  |  ( |   | ) |   const
◆ HasBoldFace()
 bool ON_FontFaceQuartet::HasBoldFace  |  ( |   | ) |   const
◆ HasBoldItalicFace()
 bool ON_FontFaceQuartet::HasBoldItalicFace  |  ( |   | ) |   const
◆ HasItalicFace()
 bool ON_FontFaceQuartet::HasItalicFace  |  ( |   | ) |   const
◆ HasRegularFace()
 bool ON_FontFaceQuartet::HasRegularFace  |  ( |   | ) |   const
◆ IsEmpty()
 bool ON_FontFaceQuartet::IsEmpty  |  ( |   | ) |   const
◆ ItalicFace()
 const class ON_Font* ON_FontFaceQuartet::ItalicFace  |  ( |   | ) |   const
◆ operator=()
 ON_FontFaceQuartet& ON_FontFaceQuartet::operator=  |  ( |  const ON_FontFaceQuartet &  |   | )
default
◆ QuartetMember()
 ON_FontFaceQuartet::Member ON_FontFaceQuartet::QuartetMember  |  ( |  const ON_Font *  |  font | ) |   const
Parameters: font - [in] Font to test Returns: If font exactly matches a quartet member, that member is identified. Otherwise, ON_FontFaceQuartet::Member::Unset is returned.
◆ QuartetName()
 const ON_wString ON_FontFaceQuartet::QuartetName  |  ( |   | ) |   const
◆ RegularFace()
 const class ON_Font* ON_FontFaceQuartet::RegularFace  |  ( |   | ) |   const
◆ RichTextSample()
 const ON_wString ON_FontFaceQuartet::RichTextSample  |  ( |  ON::RichTextStyle  |  rich_text_style | ) |   const
Returns a sample rich text string demonstrating the faces in the quartet.
Member Data Documentation
◆ Empty
 const ON_FontFaceQuartet ON_FontFaceQuartet::Empty
static