Public Member Functions | Public Attributes | Protected Member Functions | List of all members
CRhinoSdkRenderEx Class Reference
Rhino
#include <RhinoSdkRender.h>
 Inheritance diagram for CRhinoSdkRenderEx:
 Public Member Functions
virtual  | ~CRhinoSdkRenderEx ()
virtual BOOL  | AddRenderMeshToSceneEx (const CRhinoObjRef &ref, const CRhinoMaterial &material, const ON_Mesh *)
virtual LRESULT  | CallBackProc (UINT message, WPARAM wParam, LPARAM lParam)
virtual BOOL  | IgnoreRhinoObjectEx (const CRhinoObjRef &ref)
ON_DEPRECATED_MSG ("Use CRhRdkSdkRender instead") CRhinoSdkRenderEx(CRhinoDoc &doc
virtual LRESULT  | QuerySdkRenderEx (UINT message, WPARAM wParam, LPARAM lParam)
virtual RenderReturnCodes  | RenderEx (const CRhinoCommandContext &context, LPSIZE sizeImage=0, const wchar_t *lpsWindowTitle=0, UINT nIDResource=0)
virtual void  | RenderReturnCodesToStringEx (RenderReturnCodes code, ON_wString &out) const
virtual RenderReturnCodes  | RenderWindowEx (const CRhinoCommandContext &context, CRhinoView *view, const LPRECT rect, bool bRenderInWindow)
 Public Member Functions inherited from CRhinoSdkRender
virtual  | ~CRhinoSdkRender ()
virtual BOOL  | AddLightToScene (const class CRhinoLight &light)
virtual BOOL  | AddRenderMeshToScene (const CRhinoObject *object, const CRhinoMaterial &material, const ON_Mesh *)
CRhinoDoc &  | Document ()
double  | ElapsedTime (ON_wString &out) const
DWORD  | EndTime () const
int  | ErrorCode () const
virtual BOOL  | IgnoreRhinoObject (const CRhinoObject *object)
bool  | InBatchMode () const
virtual BOOL  | NeedToProcessGeometryTable ()
virtual BOOL  | NeedToProcessLightTable ()
virtual class CRhinoSdkRenderFrame *  | NewRenderFrame (CRhinoDoc *doc)=0
ON_DEPRECATED_MSG ("Use CRhRdkSdkRender instead") CRhinoSdkRender(CRhinoDoc &doc
void  | OnRenderFrameDestruction ()
For internal use only. More...
virtual void  | PauseRendering ()
CRhinoRenderPlugIn *  | PlugIn () const
int  | ProcessGeometryTable ()
int  | ProcessLightTable ()
RenderReturnCodes  | Render (const CRhinoCommandContext &context, LPSIZE sizeImage=0, const wchar_t *lpsWindowTitle=0, UINT nIDResource=0)
virtual BOOL  | RenderContinueModal ()
virtual BOOL  | RenderEnterModalLoop ()
virtual BOOL  | RenderExitModalLoop ()
virtual BOOL  | RenderPreCreateWindow ()
void  | RenderReturnCodesToString (RenderReturnCodes code, ON_wString &out) const
virtual BOOL  | RenderSceneWithNoMeshes ()
RenderReturnCodes  | RenderWindow (const CRhinoCommandContext &context, CRhinoView *view, const LPRECT rect, bool bRenderInWindow)
virtual void  | ResumeRendering ()
virtual BOOL  | StartRenderingInWindow (CRhinoView *view, const LPCRECT rect)
DWORD  | StartTime () const
virtual void  | StopRendering ()
virtual bool  | SupportsPause () const
 Public Attributes
CRhinoRenderPlugIn *  | plugin
 Public Attributes inherited from CRhinoSdkRender
CRhinoRenderPlugIn *  | plugin
 Protected Member Functions
virtual void  | OnRenderFrameDestructionEx ()
virtual int  | ProcessGeometryTableEx ()
virtual int  | ProcessLightTableEx ()
 Protected Member Functions inherited from CRhinoSdkRender
CImpl *  | Impl ()
RenderReturnCodes  | ReturnRenderCode (RenderReturnCodes rc)
CRhinoView *  | RhinoView () const
void  | SetRhinoView (CRhinoView *v)
 Additional Inherited Members
 Public Types inherited from CRhinoSdkRender
enum  | RenderReturnCodes {
 render_ok = 0, render_empty_scene, render_cancel, render_no_active_view,
 render_on_pre_create_window, render_no_frame_wnd_pointer, render_error_creating_window, render_error_starting_render,
 render_enter_modal_loop, render_exit_modal_loop, render_wm_quit
 }
Render command an helpers. More...
 Protected Attributes inherited from CRhinoSdkRender
friend  | CImpl
bool  | m_batch_mode
DWORD  | m_end_time
int  | m_error_code
int  | m_light_count
int  | m_mesh_count
CRhinoRenderPlugIn *  | m_plugin
BOOL  | m_render_canceled
CRhinoDoc &  | m_rhino_doc
CRhinoView *  | m_rhino_view
ON__UINT_PTR  | m_sdk_reserved = 0
DWORD  | m_start_time
Detailed Description
This class was added to fix a problem with blocks. If a block is being rendered then you need a CRhinoObjRef& instead of a const CRhinoObject* so that you can get the block geometry insert transform.
Constructor & Destructor Documentation
◆ ~CRhinoSdkRenderEx()
 virtual CRhinoSdkRenderEx::~CRhinoSdkRenderEx  |  ( |   | )
virtual
Member Function Documentation
◆ AddRenderMeshToSceneEx()
 virtual BOOL CRhinoSdkRenderEx::AddRenderMeshToSceneEx  |  ( |  const CRhinoObjRef &  |  ref,
|  const CRhinoMaterial &  |  material,
|  const ON_Mesh *
)
virtual
Description: Called br ProcessGeometryTableEx() when an obect is encountered that contains a render mesh. Returns: TRUE - If plug-in will render this object FALSE - object wont be rendered
◆ CallBackProc()
 virtual LRESULT CRhinoSdkRenderEx::CallBackProc  |  ( |  UINT  |  message,
|  WPARAM  |  wParam,
|  LPARAM  |  lParam
)
virtual
Description: Reserved for future use. This may be used to extend this classed functionality in the future.
◆ IgnoreRhinoObjectEx()
 virtual BOOL CRhinoSdkRenderEx::IgnoreRhinoObjectEx  |  ( |  const CRhinoObjRef &  |  ref | )
virtual
Description: Called br ProcessGeometryTableEx() when an obect is encountered that does not contain a render mesh. Returns: TRUE - object wont be rendered FALSE - If plug-in will render this object
◆ ON_DEPRECATED_MSG()
 CRhinoSdkRenderEx::ON_DEPRECATED_MSG  |  ( |  "Use CRhRdkSdkRender instead"  |   | ) |   &
◆ OnRenderFrameDestructionEx()
 virtual void CRhinoSdkRenderEx::OnRenderFrameDestructionEx  |  ( |   | )
protectedvirtual
◆ ProcessGeometryTableEx()
 virtual int CRhinoSdkRenderEx::ProcessGeometryTableEx  |  ( |   | )
protectedvirtual
◆ ProcessLightTableEx()
 virtual int CRhinoSdkRenderEx::ProcessLightTableEx  |  ( |   | )
protectedvirtual
◆ QuerySdkRenderEx()
 virtual LRESULT CRhinoSdkRenderEx::QuerySdkRenderEx  |  ( |  UINT  |  message,
|  WPARAM  |  wParam,
|  LPARAM  |  lParam
)
virtual
◆ RenderEx()
 virtual RenderReturnCodes CRhinoSdkRenderEx::RenderEx  |  ( |  const CRhinoCommandContext &  |  context,
|  LPSIZE  |  sizeImage = 0,
|  const wchar_t *  |  lpsWindowTitle = 0,
|  UINT  |  nIDResource = 0
)
virtual
◆ RenderReturnCodesToStringEx()
 virtual void CRhinoSdkRenderEx::RenderReturnCodesToStringEx  |  ( |  RenderReturnCodes  |  code,
|  ON_wString &  |  out
) |   |  const
virtual
◆ RenderWindowEx()
 virtual RenderReturnCodes CRhinoSdkRenderEx::RenderWindowEx  |  ( |  const CRhinoCommandContext &  |  context,
|  CRhinoView *  |  view,
|  const LPRECT  |  rect,
|  bool  |  bRenderInWindow
)
virtual
Member Data Documentation
◆ plugin
 CRhinoRenderPlugIn* CRhinoSdkRenderEx::plugin