Public Member Functions | Public Attributes | List of all members
CRhRdkUiScrollBarInfo Class Referencefinal
RDK
#include <RhRdkUiSdk.h>
 Public Member Functions
CRhRdkUiScrollBarInfo ()
 Public Attributes
UINT_PTR  | m_uReserved
Constructor & Destructor Documentation
◆ CRhRdkUiScrollBarInfo()
 CRhRdkUiScrollBarInfo::CRhRdkUiScrollBarInfo  |  ( |   | )
Member Data Documentation
◆ m_uReserved
 UINT_PTR CRhRdkUiScrollBarInfo::m_uReserved