Public Member Functions | List of all members
CRhRdkActions Class Reference
RDK
#include <RhRdkUiSdk.h>
 Inheritance diagram for CRhRdkActions:
 Public Member Functions
CRhRdkActions ()
virtual  | ~CRhRdkActions ()
virtual CRhRdkAction *  | Action (int iIndex) const
virtual bool  | Add (CRhRdkAction *pAction)
virtual int  | Count (void) const
virtual CRhRdkAction *  | Find (const UUID &uuidAction) const
virtual CRhRdkAction *  | Find (unsigned short cmd) const
 Public Member Functions inherited from IRhRdkActions
virtual  | ~IRhRdkActions ()
virtual void *  | EVF (const wchar_t *, void *)=0
Constructor & Destructor Documentation
◆ CRhRdkActions()
 CRhRdkActions::CRhRdkActions  |  ( |   | )
◆ ~CRhRdkActions()
 virtual CRhRdkActions::~CRhRdkActions  |  ( |   | )
virtual
Member Function Documentation
◆ Action()
 virtual CRhRdkAction* CRhRdkActions::Action  |  ( |  int  |  iIndex | ) |   const
virtual
Implements IRhRdkActions.
◆ Add()
 virtual bool CRhRdkActions::Add  |  ( |  CRhRdkAction *  |  pAction | )
virtual
Implements IRhRdkActions.
◆ Count()
 virtual int CRhRdkActions::Count  |  ( |  void  |   | ) |   const
virtual
Implements IRhRdkActions.
◆ Find() [1/2]
 virtual CRhRdkAction* CRhRdkActions::Find  |  ( |  const UUID &  |  uuidAction | ) |   const
virtual
Implements IRhRdkActions.
◆ Find() [2/2]
 virtual CRhRdkAction* CRhRdkActions::Find  |  ( |  unsigned short  |  cmd | ) |   const
virtual
Implements IRhRdkActions.